_posts/2013-09-28-linux-distributions-as-a-service.html
---
title: "Linux distributions as a service"
date: 2013-09-28
layout: post
categories: Linux
published: true
comments: true
---
<p>
One of my colleague installed Ubuntu on its Mac computers and was
surprised by the varieties of Ubuntu distributions offered. There are
different distributions and differents architectures and he was
wondering how they managed this complexity.
</p>

<p>
This gave me an idea. What about having even more distributions? What
about having <span class="underline">personalized distribution customized for your
particular machine</span> ?
</p>

<p>
A usage scenario could be like this:
</p>

<ul class="org-ul">
<li>you go on the website of a Linux distribution,
</li>
<li>start an application that analyze your hardware,
</li>
<li>answer a few questions about your requirements (security, network,
etc),
</li>
<li>choose the graphical environment, choose or customize some graphical
themes (for a desktop distribution) etc.
</li>
<li>you then get a link where you could download your own customized
distribution, tailored for your needs and hardware. Or maybe you enter
an email and you get a link via email when the build is finished.
</li>
</ul>

<p>
Common choices and typical hardware configurations could be shared by
the community.
</p>

<p>
It would require a good infrastructure but it could be a service people
would be ready to pay for.
</p>

<p>
Currently only expert Linux users can tailor their distributions for
their needs, Linux distributions as a service (or "on demand") could
bring more power and more control to a broader public.
</p>
